app/controllers/contacts_controller.rb

 def create
  @contact = Contact.new(contact_params)
  name=params[:contact][:photo].original_filename
  @contact.photo=name
  if@contact.save
---
INSERT INTO "contacts" ("address", "created_at", "email_id", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", ""], ["created_at", "2014-06-19 10:44:15.558036"], ["email_id", ""], ["first_name", "huhu"], ["last_name", ""], ["updated_at", "2014-06-19 10:44:15.558036"]]

 def update
  @contact = Contact.find(params[:id])
  name=params[:contact][:photo].original_filename
  @contact.update(:photo => name)
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "contacts" SET "mobile_no" = ?, "updated_at" = ? WHERE "contacts"."id" = 6  [["mobile_no", 9856321456], ["updated_at", "2014-06-19 11:17:55.388210"]]